# HadToAlignEaves Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..HadToAlignEaves Property
BuiltInFailures..::..RoofFailures Class See Also
---
Adjacent slope-defining lines must have identical eave heights. Eaves were aligned to higher location automatically to avoid failure. Use the Align Eaves tool to specify desired location.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HadToAlignEaves { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HadToAlignEaves As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HadToAlignEaves {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace